app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`title`, `descrtiption`, `created_at`, `updated_at`) VALUES ('Welcome to Udaman Site!!!', 'Hi everyone, I hope you like the site!', '2015-06-11 06:40:23.036396', '2015-06-11 06:40:23.036396')